app/views/matiers/show_matier.html.erb

				<%= form_tag('/matier/:id') do %>
					<%= select("post", "matiers_name", Matier.all.collect { |m| [ m.name, m.id ] }, { prompt: 'Ce que vous allez apprendre'}) %>
---
SELECT "matiers".* FROM "matiers"