app/controllers/landingpages_controller.rb

  def home
  	@matier = Matier.all
---
SELECT "matiers".* FROM "matiers"

  def get_matier
  	@matier = Matier.find(params[:post][:matiers_name])
---
SELECT  "matiers".* FROM "matiers" WHERE "matiers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]