app/controllers/matiers_controller.rb

  def index
  	@matier = Matier.all
---
SELECT "matiers".* FROM "matiers"

  def show_matier
  	@matier = Matier.find(params[:id])
---
SELECT  "matiers".* FROM "matiers" WHERE "matiers"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]